UKTailwind/PicoMiteAllVersions/ports/esp32_s3/main/esp32_ili9341_lcd.c
/*
 * esp32_ili9341_lcd.c - ESP-IDF SPI-master ILI9341 backend for ESP32-S3.
 *
 * This is intentionally independent of the Pico SPI-LCD driver stack. Board
 * profile data supplies the pins; Draw.c supplies the drawing dispatch.
 */

#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "MMBasic_Includes.h"
#include "Hardware_Includes.h"
#include "esp32_backlight.h"
#include "esp32_board_profile.h"

#define LCD_W 320
#define LCD_H 240
#define LCD_SPI_HOST SPI3_HOST
#define LCD_DIRTY_TILE 16
#define LCD_DIRTY_COLS ((LCD_W + LCD_DIRTY_TILE - 1) / LCD_DIRTY_TILE)
#define LCD_DIRTY_ROWS ((LCD_H + LCD_DIRTY_TILE - 1) / LCD_DIRTY_TILE)

#define LCD_SWRESET 0x01
#define LCD_SLPOUT  0x11
#define LCD_NORON   0x13
#define LCD_INVON   0x21
#define LCD_DISPON  0x29
#define LCD_CASET   0x2A
#define LCD_PASET   0x2B
#define LCD_RAMWR   0x2C
#define LCD_MADCTL  0x36
#define LCD_PIXFMT  0x3A
#define LCD_FRMCTR1 0xB1
#define LCD_DISCTRL 0xB6
#define LCD_PWCTR1  0xC0
#define LCD_PWCTR2  0xC1
#define LCD_VMCTR1  0xC5
#define LCD_VMCTR2  0xC7

static const char * TAG = "ili9341";
static spi_device_handle_t s_lcd;
static uint32_t * s_shadow;
static int s_dc_gpio = -1;
static uint8_t s_line[LCD_W * 2];
#define LCD_FLUSH_ROWS 16
#define LCD_FLUSH_BYTES (LCD_W * 2 * LCD_FLUSH_ROWS)
static uint8_t * s_flush;
static int s_dirty;
static int s_dirty_x1, s_dirty_y1, s_dirty_x2, s_dirty_y2;
static uint32_t s_dirty_tiles[LCD_DIRTY_ROWS];

extern volatile int DISPLAY_TYPE;
extern unsigned char OptionConsole;
extern const int colours[16];
extern int RGB121map[16];

static uint16_t rgb565(int c) {
    uint32_t v = (uint32_t)c;
    return (uint16_t)(((v & 0x00f80000u) >> 8) |
                      ((v & 0x0000f800u) >> 5) |
                      ((v & 0x000000f8u) >> 3));
}

static void esp32_lcd_scroll(int lines);
void esp32_ili9341_lcd_flush_pending(void);

static void put565(uint8_t * p, int c) {
    uint16_t v = rgb565(c);
    p[0] = (uint8_t)(v >> 8);
    p[1] = (uint8_t)v;
}

static int rgb121_palette_colour(uint8_t nibble) {
    nibble &= 0x0f;
    return RGB121map[15] ? RGB121map[nibble] : colours[nibble];
}

static uint8_t packed_rgb121_get(const uint8_t * p, int index) {
    uint8_t b = p[(size_t)index >> 1];
    return (index & 1) ? (uint8_t)(b >> 4) : (uint8_t)(b & 0x0fu);
}

static void packed_rgb121_set(uint8_t * p, int index, uint8_t v) {
    uint8_t * b = &p[(size_t)index >> 1];
    if (index & 1)
        *b = (uint8_t)((*b & 0x0fu) | ((v & 0x0fu) << 4));
    else
        *b = (uint8_t)((*b & 0xf0u) | (v & 0x0fu));
}

static void lcd_tx(const void * data, size_t len, int dc) {
    if (!s_lcd || !data || len == 0) return;
    gpio_set_level((gpio_num_t)s_dc_gpio, dc);
    spi_transaction_t t = {0};
    t.length = len * 8;
    t.tx_buffer = data;
    esp_err_t err = spi_device_polling_transmit(s_lcd, &t);
    if (err != ESP_OK) ESP_LOGW(TAG, "spi transmit failed: %s", esp_err_to_name(err));
}

static void lcd_cmd(uint8_t cmd) {
    lcd_tx(&cmd, 1, 0);
}

static void lcd_data(const uint8_t * data, size_t len) {
    lcd_tx(data, len, 1);
}

static void lcd_cmd_data(uint8_t cmd, const uint8_t * data, size_t len) {
    lcd_cmd(cmd);
    lcd_data(data, len);
}

static void lcd_addr_window(int x1, int y1, int x2, int y2) {
    uint8_t b[4];
    b[0] = (uint8_t)(x1 >> 8); b[1] = (uint8_t)x1;
    b[2] = (uint8_t)(x2 >> 8); b[3] = (uint8_t)x2;
    lcd_cmd_data(LCD_CASET, b, sizeof(b));
    b[0] = (uint8_t)(y1 >> 8); b[1] = (uint8_t)y1;
    b[2] = (uint8_t)(y2 >> 8); b[3] = (uint8_t)y2;
    lcd_cmd_data(LCD_PASET, b, sizeof(b));
    lcd_cmd(LCD_RAMWR);
}

static void lcd_push_line_rgb565(int x, int y, int w, const uint8_t * line) {
    if (w <= 0) return;
    lcd_addr_window(x, y, x + w - 1, y);
    lcd_data(line, (size_t)w * 2u);
}

static uint8_t * lcd_batch_buffer(int w, int * rows_per_batch) {
    int rows = 1;
    uint8_t * buf = s_line;
    if (s_flush && w > 0) {
        rows = LCD_FLUSH_BYTES / (w * 2);
        if (rows < 1) rows = 1;
        if (rows > LCD_FLUSH_ROWS) rows = LCD_FLUSH_ROWS;
        buf = s_flush;
    }
    if (rows_per_batch) *rows_per_batch = rows;
    return buf;
}

static uint8_t * lcd_batch_buffer_for_area(int w, int h, int * rows_per_batch) {
    if (!s_flush || w <= 0 || h <= 0 || (size_t)w * (size_t)h * 2u < 2048u) {
        if (rows_per_batch) *rows_per_batch = 1;
        return s_line;
    }
    int rows;
    uint8_t * buf = lcd_batch_buffer(w, &rows);
    if (rows > h) rows = h;
    if (rows_per_batch) *rows_per_batch = rows;
    return buf;
}

static int clip_rect(int * x1, int * y1, int * x2, int * y2) {
    if (*x1 > *x2) { int t = *x1; *x1 = *x2; *x2 = t; }
    if (*y1 > *y2) { int t = *y1; *y1 = *y2; *y2 = t; }
    if (*x1 < 0) *x1 = 0;
    if (*y1 < 0) *y1 = 0;
    if (*x2 >= LCD_W) *x2 = LCD_W - 1;
    if (*y2 >= LCD_H) *y2 = LCD_H - 1;
    return *x1 <= *x2 && *y1 <= *y2;
}

static void shadow_rect(int x1, int y1, int x2, int y2, uint32_t c) {
    if (!s_shadow) return;
    for (int y = y1; y <= y2; y++) {
        uint32_t * row = s_shadow + (size_t)y * LCD_W;
        for (int x = x1; x <= x2; x++) row[x] = c;
    }
}

static void dirty_mark(int x1, int y1, int x2, int y2) {
    if (!clip_rect(&x1, &y1, &x2, &y2)) return;
    int tx1 = x1 / LCD_DIRTY_TILE;
    int tx2 = x2 / LCD_DIRTY_TILE;
    int ty1 = y1 / LCD_DIRTY_TILE;
    int ty2 = y2 / LCD_DIRTY_TILE;
    uint32_t bits = ((1u << (tx2 - tx1 + 1)) - 1u) << tx1;
    for (int ty = ty1; ty <= ty2; ty++) s_dirty_tiles[ty] |= bits;
    if (!s_dirty) {
        s_dirty_x1 = x1;
        s_dirty_y1 = y1;
        s_dirty_x2 = x2;
        s_dirty_y2 = y2;
    } else {
        if (x1 < s_dirty_x1) s_dirty_x1 = x1;
        if (y1 < s_dirty_y1) s_dirty_y1 = y1;
        if (x2 > s_dirty_x2) s_dirty_x2 = x2;
        if (y2 > s_dirty_y2) s_dirty_y2 = y2;
    }
    s_dirty = 1;
}

static void dirty_clear(void) {
    s_dirty = 0;
    s_dirty_x1 = s_dirty_y1 = 0;
    s_dirty_x2 = s_dirty_y2 = 0;
    memset(s_dirty_tiles, 0, sizeof(s_dirty_tiles));
}

