UKTailwind/PicoMiteAllVersions/ports/esp32_s3/main/esp32_ili9341_lcd.c
static void flush_shadow_rect(int x1, int y1, int x2, int y2) {
    if (!s_shadow || !clip_rect(&x1, &y1, &x2, &y2)) return;
    int w = x2 - x1 + 1;
    int h = y2 - y1 + 1;
    int rows_per_batch;
    uint8_t * tx = lcd_batch_buffer(w, &rows_per_batch);

    lcd_addr_window(x1, y1, x2, y2);
    for (int yoff = 0; yoff < h;) {
        int rows = h - yoff;
        if (rows > rows_per_batch) rows = rows_per_batch;
        uint8_t * out = tx;
        for (int ry = 0; ry < rows; ry++) {
            uint32_t * src = s_shadow + (size_t)(y1 + yoff + ry) * LCD_W + x1;
            for (int x = 0; x < w; x++) {
                put565(out, (int)src[x]);
                out += 2;
            }
        }
        lcd_data(tx, (size_t)rows * (size_t)w * 2u);
        yoff += rows;
    }
}

static void esp32_lcd_draw_rectangle(int x1, int y1, int x2, int y2, int c) {
    if (!clip_rect(&x1, &y1, &x2, &y2)) return;
    esp32_ili9341_lcd_flush_pending();
    int w = x2 - x1 + 1;
    int h = y2 - y1 + 1;
    uint32_t c24 = (uint32_t)c & 0x00ffffffu;
    shadow_rect(x1, y1, x2, y2, c24);

    int rows_per_batch;
    uint8_t * tx = lcd_batch_buffer_for_area(w, h, &rows_per_batch);
    uint8_t * row0 = tx;
    for (int x = 0; x < w; x++) put565(&row0[x * 2], c);
    for (int y = 1; y < rows_per_batch; y++)
        memcpy(tx + (size_t)y * w * 2u, row0, (size_t)w * 2u);

    lcd_addr_window(x1, y1, x2, y2);
    for (int y = 0; y < h;) {
        int rows = h - y;
        if (rows > rows_per_batch) rows = rows_per_batch;
        lcd_data(tx, (size_t)rows * w * 2u);
        y += rows;
    }
}

static void esp32_lcd_draw_pixel(int x, int y, int c) {
    if (!s_shadow || x < 0 || y < 0 || x >= LCD_W || y >= LCD_H) return;
    s_shadow[(size_t)y * LCD_W + (size_t)x] = (uint32_t)c & 0x00ffffffu;
    dirty_mark(x, y, x, y);
}

static void esp32_lcd_draw_bitmap(int x, int y, int width, int height,
                                  int scale, int fc, int bc,
                                  unsigned char * bitmap) {
    if (!bitmap || width <= 0 || height <= 0) return;
    if (scale < 1) scale = 1;
    int total_bits = width * height;
    int out_w = width * scale;
    int out_h = height * scale;
    int cx1 = x, cy1 = y, cx2 = x + out_w - 1, cy2 = y + out_h - 1;
    if (!clip_rect(&cx1, &cy1, &cx2, &cy2)) return;
    int dirty = bc >= 0;

    for (int py = cy1; py <= cy2; py++) {
        int row = (py - y) / scale;
        for (int px = cx1; px <= cx2; px++) {
            int col = (px - x) / scale;
            int bit = row * width + col;
            int on = (bitmap[bit / 8] >> ((total_bits - bit - 1) % 8)) & 1;
            if (!on && bc < 0) continue;
            int c = on ? fc : bc;
            if (s_shadow)
                s_shadow[(size_t)py * LCD_W + (size_t)px] = (uint32_t)c & 0x00ffffffu;
            dirty = 1;
        }
    }
    if (dirty) dirty_mark(cx1, cy1, cx2, cy2);
}

static void esp32_lcd_draw_buffer(int x1, int y1, int x2, int y2,
                                  unsigned char * bgr) {
    if (!bgr) return;
    esp32_ili9341_lcd_flush_pending();
    if (x1 > x2) { int t = x1; x1 = x2; x2 = t; }
    if (y1 > y2) { int t = y1; y1 = y2; y2 = t; }
    int src_w = x2 - x1 + 1;
    int cx1 = x1, cy1 = y1, cx2 = x2, cy2 = y2;
    if (!clip_rect(&cx1, &cy1, &cx2, &cy2)) return;
    int w = cx2 - cx1 + 1;
    int h = cy2 - cy1 + 1;
    int rows_per_batch;
    uint8_t * tx = lcd_batch_buffer_for_area(w, h, &rows_per_batch);
    lcd_addr_window(cx1, cy1, cx2, cy2);

    for (int yoff = 0; yoff < h;) {
        int rows = h - yoff;
        if (rows > rows_per_batch) rows = rows_per_batch;
        for (int ry = 0; ry < rows; ry++) {
            int y = cy1 + yoff + ry;
            unsigned char * src = bgr + ((size_t)(y - y1) * (size_t)src_w +
                                         (size_t)(cx1 - x1)) * 3u;
            uint8_t * out = tx + (size_t)ry * w * 2u;
            for (int x = cx1; x <= cx2; x++) {
                int c = ((int)src[2] << 16) | ((int)src[1] << 8) | src[0];
                if (s_shadow) s_shadow[(size_t)y * LCD_W + (size_t)x] = (uint32_t)c;
                put565(&out[(x - cx1) * 2], c);
                src += 3;
            }
        }
        lcd_data(tx, (size_t)rows * w * 2u);
        yoff += rows;
    }
}

static void esp32_lcd_draw_buffer_fast(int x1, int y1, int x2, int y2,
                                       int blank, unsigned char * p) {
    if (!p) return;
    esp32_ili9341_lcd_flush_pending();
    if (x1 > x2) { int t = x1; x1 = x2; x2 = t; }
    if (y1 > y2) { int t = y1; y1 = y2; y2 = t; }
    int src_w = x2 - x1 + 1;
    int cx1 = x1, cy1 = y1, cx2 = x2, cy2 = y2;
    if (!clip_rect(&cx1, &cy1, &cx2, &cy2)) return;
    for (int y = cy1; y <= cy2; y++) {
        int run_x = -1;
        int run_w = 0;
        for (int x = cx1; x <= cx2; x++) {
            int src_index = (y - y1) * src_w + (x - x1);
            uint8_t nibble = packed_rgb121_get(p, src_index);
            if (blank != -1 && nibble == sprite_transparent) {
                if (run_w) {
                    lcd_push_line_rgb565(run_x, y, run_w, s_line);
                    run_w = 0;
                    run_x = -1;
                }
                continue;
            }
            int c = rgb121_palette_colour(nibble);
            if (run_x < 0) run_x = x;
            if (run_x + run_w != x) {
                lcd_push_line_rgb565(run_x, y, run_w, s_line);
                run_x = x;
                run_w = 0;
            }
            if (s_shadow) s_shadow[(size_t)y * LCD_W + (size_t)x] = (uint32_t)c;
            put565(&s_line[run_w * 2], c);
            run_w++;
        }
        if (run_w) lcd_push_line_rgb565(run_x, y, run_w, s_line);
    }
}

static void esp32_lcd_read_buffer(int x1, int y1, int x2, int y2,
                                  unsigned char * bgr) {
    if (!bgr) return;
    if (x1 > x2) { int t = x1; x1 = x2; x2 = t; }
    if (y1 > y2) { int t = y1; y1 = y2; y2 = t; }
    for (int y = y1; y <= y2; y++) {
        for (int x = x1; x <= x2; x++) {
            uint32_t c = 0;
            if (s_shadow && x >= 0 && y >= 0 && x < LCD_W && y < LCD_H)
                c = s_shadow[(size_t)y * LCD_W + (size_t)x];
            *bgr++ = (uint8_t)c;
            *bgr++ = (uint8_t)(c >> 8);
            *bgr++ = (uint8_t)(c >> 16);
        }
    }
}

static void esp32_lcd_read_buffer_fast(int x1, int y1, int x2, int y2,
                                       unsigned char * p) {
    if (!p) return;
    if (x1 > x2) { int t = x1; x1 = x2; x2 = t; }
    if (y1 > y2) { int t = y1; y1 = y2; y2 = t; }
    int index = 0;
    for (int y = y1; y <= y2; y++) {
        for (int x = x1; x <= x2; x++) {
            uint8_t nibble = 0;
            if (s_shadow && x >= 0 && y >= 0 && x < LCD_W && y < LCD_H)
                nibble = RGB121(s_shadow[(size_t)y * LCD_W + (size_t)x]);
            packed_rgb121_set(p, index++, nibble);
        }
    }
}

static void flush_shadow_full(void) {
    if (!s_shadow) return;
    flush_shadow_rect(0, 0, LCD_W - 1, LCD_H - 1);
    dirty_clear();
}

void esp32_ili9341_lcd_flush_pending(void) {
    if (!s_dirty || !s_shadow || !s_lcd) return;
    uint32_t dirty[LCD_DIRTY_ROWS];
    memcpy(dirty, s_dirty_tiles, sizeof(dirty));
    int x1 = s_dirty_x1;
    int y1 = s_dirty_y1;
    int x2 = s_dirty_x2;
    int y2 = s_dirty_y2;
    dirty_clear();

    int bbox_area = (x2 - x1 + 1) * (y2 - y1 + 1);
    int tile_area = 0;
    for (int ty = 0; ty < LCD_DIRTY_ROWS; ty++) {
        uint32_t mask = dirty[ty];
        while (mask) {
            int tx = __builtin_ctz(mask);
            int tw = LCD_DIRTY_TILE;
            int th = LCD_DIRTY_TILE;
            if ((tx + 1) * LCD_DIRTY_TILE > LCD_W) tw = LCD_W - tx * LCD_DIRTY_TILE;
            if ((ty + 1) * LCD_DIRTY_TILE > LCD_H) th = LCD_H - ty * LCD_DIRTY_TILE;
            tile_area += tw * th;
            mask &= ~(1u << tx);
        }
    }
    if (bbox_area <= tile_area) {
        flush_shadow_rect(x1, y1, x2, y2);
        return;
    }

