UKTailwind/PicoMiteAllVersions/ports/esp32_s3/main/esp32_ili9341_lcd.c
    for (int ty = 0; ty < LCD_DIRTY_ROWS;) {
        if (!dirty[ty]) {
            ty++;
            continue;
        }
        uint32_t mask = dirty[ty];
        int tx1 = __builtin_ctz(mask);
        int tx2 = tx1;
        while (tx2 + 1 < LCD_DIRTY_COLS && (mask & (1u << (tx2 + 1)))) tx2++;
        uint32_t span = ((1u << (tx2 - tx1 + 1)) - 1u) << tx1;
        int ty2 = ty;
        while (ty2 + 1 < LCD_DIRTY_ROWS && dirty[ty2 + 1] == span) ty2++;

        int x1 = tx1 * LCD_DIRTY_TILE;
        int y1 = ty * LCD_DIRTY_TILE;
        int x2 = (tx2 + 1) * LCD_DIRTY_TILE - 1;
        int y2 = (ty2 + 1) * LCD_DIRTY_TILE - 1;
        flush_shadow_rect(x1, y1, x2, y2);

        for (int row = ty; row <= ty2; row++) dirty[row] &= ~span;
        if (!dirty[ty]) ty++;
    }
}

int esp32_ili9341_lcd_ready(void) {
    return s_lcd != NULL && s_shadow != NULL && Option.DISPLAY_TYPE == ILI9341 &&
           HRes == LCD_W && VRes == LCD_H;
}

static void esp32_ili9341_lcd_bind_panel(void) {
    HRes = DisplayHRes = LCD_W;
    VRes = DisplayVRes = LCD_H;
    ScreenSize = LCD_W * LCD_H;
    Option.DISPLAY_TYPE = ILI9341;
    DISPLAY_TYPE = ILI9341;
    Option.DISPLAY_CONSOLE = 1;
    Option.Refresh = 0;
    OptionConsole = 3;
    DrawPixel = esp32_lcd_draw_pixel;
    DrawRectangle = esp32_lcd_draw_rectangle;
    DrawBitmap = esp32_lcd_draw_bitmap;
    DrawBuffer = esp32_lcd_draw_buffer;
    DrawBLITBuffer = esp32_lcd_draw_buffer;
    DrawBufferFast = esp32_lcd_draw_buffer_fast;
    ReadBuffer = esp32_lcd_read_buffer;
    ReadBLITBuffer = esp32_lcd_read_buffer;
    ReadBufferFast = esp32_lcd_read_buffer_fast;
    ScrollLCD = esp32_lcd_scroll;
}

int esp32_ili9341_lcd_restore_panel(void) {
    if (!s_lcd || !s_shadow) return 0;
    esp32_ili9341_lcd_bind_panel();
    return 1;
}

int port_editor_display_scroll_supported(void) {
    return esp32_ili9341_lcd_ready() && ScrollLCD == esp32_lcd_scroll;
}

void esp32_ili9341_lcd_snapshot_rgb121(uint8_t * out) {
    if (!out || !esp32_ili9341_lcd_ready()) return;
    int index = 0;
    for (int y = 0; y < LCD_H; y++) {
        for (int x = 0; x < LCD_W; x++) {
            uint8_t nibble = RGB121(s_shadow[(size_t)y * LCD_W + (size_t)x]);
            packed_rgb121_set(out, index++, nibble);
        }
    }
}

void esp32_ili9341_lcd_present_rgb121_diff(uint8_t * back, uint8_t * front) {
    if (!esp32_ili9341_lcd_ready() || !back || !front) return;
    esp32_ili9341_lcd_flush_pending();
    const int stride = LCD_W / 2;
    int y = 0;
    while (y < LCD_H) {
        if (memcmp(back + (size_t)y * stride, front + (size_t)y * stride,
                   (size_t)stride) == 0) {
            y++;
            continue;
        }

        int y_start = y;
        int x_min = stride;
        int x_max = 0;
        while (y < LCD_H &&
               memcmp(back + (size_t)y * stride, front + (size_t)y * stride,
                      (size_t)stride) != 0) {
            uint8_t * b = back + (size_t)y * stride;
            uint8_t * f = front + (size_t)y * stride;
            for (int x = 0; x < stride; x++) {
                if (b[x] != f[x]) {
                    if (x < x_min) x_min = x;
                    if (x > x_max) x_max = x;
                }
            }
            y++;
        }
        int y_end = y;
        int px_start = x_min * 2;
        int px_end = x_max * 2 + 1;
        int pixel_count = px_end - px_start + 1;
        int rows_per_batch;
        uint8_t * tx = lcd_batch_buffer(pixel_count, &rows_per_batch);

        for (int sy = y_start; sy < y_end;) {
            int rows = y_end - sy;
            if (rows > rows_per_batch) rows = rows_per_batch;
            for (int ry = 0; ry < rows; ry++) {
                int yrow = sy + ry;
                uint8_t * src = back + (size_t)yrow * stride + x_min;
                uint8_t * dst = front + (size_t)yrow * stride + x_min;
                uint8_t * outp = tx + (size_t)ry * pixel_count * 2u;
                for (int bx = x_min, out = 0; bx <= x_max; bx++) {
                    uint8_t byte = src[bx - x_min];
                    int c0 = rgb121_palette_colour(byte);
                    int c1 = rgb121_palette_colour(byte >> 4);
                    if (s_shadow) {
                        size_t off = (size_t)yrow * LCD_W + (size_t)(bx * 2);
                        s_shadow[off] = (uint32_t)c0 & 0x00ffffffu;
                        s_shadow[off + 1] = (uint32_t)c1 & 0x00ffffffu;
                    }
                    put565(&outp[out], c0);
                    out += 2;
                    put565(&outp[out], c1);
                    out += 2;
                }
                memcpy(dst, src, (size_t)(x_max - x_min + 1));
            }
            lcd_addr_window(px_start, sy, px_end, sy + rows - 1);
            lcd_data(tx, (size_t)rows * pixel_count * 2u);
            sy += rows;
        }
    }
}

void esp32_ili9341_lcd_present_rgb121_rect(const uint8_t * src,
                                           int xstart, int xend,
                                           int ystart, int yend,
                                           int odd) {
    if (!esp32_ili9341_lcd_ready() || !src) return;
    esp32_ili9341_lcd_flush_pending();
    int src_w = xend - xstart + 1;
    if (src_w <= 0) return;
    int cx1 = xstart, cy1 = ystart, cx2 = xend, cy2 = yend;
    if (!clip_rect(&cx1, &cy1, &cx2, &cy2)) return;
    int w = cx2 - cx1 + 1;
    int h = cy2 - cy1 + 1;
    int rows_per_batch;
    uint8_t * tx = lcd_batch_buffer(w, &rows_per_batch);

    lcd_addr_window(cx1, cy1, cx2, cy2);
    for (int yoff = 0; yoff < h;) {
        int rows = h - yoff;
        if (rows > rows_per_batch) rows = rows_per_batch;
        for (int ry = 0; ry < rows; ry++) {
            int y = cy1 + yoff + ry;
            int src_row_base = (y - ystart) * src_w;
            uint8_t * out = tx + (size_t)ry * w * 2u;
            for (int x = cx1; x <= cx2; x++) {
                int src_index = src_row_base + (x - xstart);
                int packed_index = src_index + (odd ? 1 : 0);
                uint8_t byte = src[(size_t)packed_index >> 1];
                uint8_t nibble = (packed_index & 1) ? (uint8_t)(byte >> 4)
                                                    : (uint8_t)(byte & 0x0f);
                int c = rgb121_palette_colour(nibble);
                if (s_shadow)
                    s_shadow[(size_t)y * LCD_W + (size_t)x] = (uint32_t)c & 0x00ffffffu;
                put565(&out[(x - cx1) * 2], c);
            }
        }
        lcd_data(tx, (size_t)rows * w * 2u);
        yoff += rows;
    }
}

static void esp32_lcd_scroll(int lines) {
    if (!s_shadow || lines == 0) return;
    ScrollStart = 0;
    uint32_t bg = (uint32_t)gui_bcolour & 0x00ffffffu;
    if (lines <= -LCD_H || lines >= LCD_H) {
        for (size_t i = 0; i < (size_t)LCD_W * LCD_H; i++) s_shadow[i] = bg;
        flush_shadow_full();
        return;
    }
    int abs_lines = lines < 0 ? -lines : lines;
    if (lines > 0) {
        size_t row_words = LCD_W;
        memmove(s_shadow, s_shadow + (size_t)lines * row_words,
                (size_t)(LCD_H - lines) * row_words * sizeof(*s_shadow));
        uint32_t * tail = s_shadow + (size_t)(LCD_H - lines) * row_words;
        for (size_t i = 0; i < (size_t)lines * row_words; i++) tail[i] = bg;
    } else {
        size_t row_words = LCD_W;
        memmove(s_shadow + (size_t)abs_lines * row_words, s_shadow,
                (size_t)(LCD_H - abs_lines) * row_words * sizeof(*s_shadow));
        for (size_t i = 0; i < (size_t)abs_lines * row_words; i++) s_shadow[i] = bg;
    }
    flush_shadow_full();
}

static void lcd_init_controller(void) {
    lcd_cmd(LCD_SWRESET);
    vTaskDelay(pdMS_TO_TICKS(5));

    const uint8_t pw1[] = {0x23};
    const uint8_t pw2[] = {0x10};
    const uint8_t vm1[] = {0x2b, 0x2b};
    const uint8_t vm2[] = {0xc0};
    const uint8_t pix[] = {0x55};
    const uint8_t frm[] = {0x00, 0x1b};
    const uint8_t dis[] = {0x0a, 0x82, 0x27};
    const uint8_t mad[] = {0x28}; /* landscape, BGR */
    lcd_cmd_data(LCD_PWCTR1, pw1, sizeof(pw1));
    lcd_cmd_data(LCD_PWCTR2, pw2, sizeof(pw2));
    lcd_cmd_data(LCD_VMCTR1, vm1, sizeof(vm1));
    lcd_cmd_data(LCD_VMCTR2, vm2, sizeof(vm2));
    lcd_cmd_data(LCD_PIXFMT, pix, sizeof(pix));
    lcd_cmd_data(LCD_FRMCTR1, frm, sizeof(frm));
    lcd_cmd_data(LCD_DISCTRL, dis, sizeof(dis));
    lcd_cmd(LCD_SLPOUT);
    vTaskDelay(pdMS_TO_TICKS(120));
    lcd_cmd(LCD_NORON);
    /* Freenove's ILI9341 panel uses the inverted colour polarity; without
     * this red presents as cyan and the whole palette is complemented. */
    lcd_cmd(LCD_INVON);
    lcd_cmd_data(LCD_MADCTL, mad, sizeof(mad));
    ScrollStart = 0;
    lcd_cmd(LCD_DISPON);
    vTaskDelay(pdMS_TO_TICKS(20));
}

static int lcd_gpio_valid(int gpio) {
    return gpio >= 0 && gpio < HAL_PORT_GPIO_COUNT;
}

static int lcd_gpio_available(int gpio) {
    if (gpio == ESP32_BOARD_PROFILE_NO_PIN) return 1;
    if (!lcd_gpio_valid(gpio)) return 0;
    int pin = codemap(gpio);
    return pin > 0 && pin <= NBRPINS && ExtCurrentConfig[pin] == EXT_NOT_CONFIG;
}

static int lcd_profile_pins_available(const esp32_board_profile_t * profile) {
    return lcd_gpio_available(profile->lcd.sclk) &&
           lcd_gpio_available(profile->lcd.mosi) &&
           lcd_gpio_available(profile->lcd.miso) &&
           lcd_gpio_available(profile->lcd.cs) &&
           lcd_gpio_available(profile->lcd.dc) &&
           lcd_gpio_available(profile->lcd.rst) &&
           lcd_gpio_available(profile->lcd.backlight);
}

static void lcd_release_resources(int bus_inited) {
    dirty_clear();
    if (s_lcd) {
        (void)spi_bus_remove_device(s_lcd);
        s_lcd = NULL;
    }
    if (bus_inited) (void)spi_bus_free(LCD_SPI_HOST);
    if (s_shadow) {
        heap_caps_free(s_shadow);
        s_shadow = NULL;
    }
    if (s_flush) {
        heap_caps_free(s_flush);
        s_flush = NULL;
    }
    s_dc_gpio = -1;
}

void esp32_ili9341_lcd_init(void) {
    const esp32_board_profile_t * profile = esp32_board_profile_current();
    if (!profile->has_lcd || Option.WebConsole || s_lcd) return;
    dirty_clear();
    if (!lcd_gpio_valid(profile->lcd.sclk) ||
        !lcd_gpio_valid(profile->lcd.mosi) ||
        !lcd_gpio_valid(profile->lcd.cs) ||
        !lcd_gpio_valid(profile->lcd.dc)) {
        ESP_LOGW(TAG, "selected profile has incomplete LCD pins");
        return;
    }
    if (!lcd_profile_pins_available(profile)) {
        ESP_LOGW(TAG, "selected profile LCD pins are already in use");
        return;
    }

    spi_bus_config_t bus = {
        .mosi_io_num = profile->lcd.mosi,
        .miso_io_num = profile->lcd.miso,
        .sclk_io_num = profile->lcd.sclk,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = LCD_FLUSH_BYTES,
    };
    esp_err_t err = spi_bus_initialize(LCD_SPI_HOST, &bus, SPI_DMA_CH_AUTO);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "spi_bus_initialize failed: %s", esp_err_to_name(err));
        return;
    }

