UKTailwind/PicoMiteAllVersions/ports/esp32_s3/main/esp32_ili9341_lcd.c
    spi_device_interface_config_t dev = {
        .clock_speed_hz = profile->lcd.spi_hz > 0 ? profile->lcd.spi_hz : 40000000,
        .mode = 0,
        .spics_io_num = profile->lcd.cs,
        .queue_size = 1,
    };
    err = spi_bus_add_device(LCD_SPI_HOST, &dev, &s_lcd);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "spi_bus_add_device failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    int actual_khz = 0;
    err = spi_device_get_actual_freq(s_lcd, &actual_khz);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "LCD SPI configured=%d Hz actual=%d kHz",
                 dev.clock_speed_hz, actual_khz);
    } else {
        ESP_LOGW(TAG, "spi_device_get_actual_freq failed: %s", esp_err_to_name(err));
    }

    s_dc_gpio = profile->lcd.dc;
    gpio_config_t out = {
        .pin_bit_mask = 1ULL << (uint32_t)s_dc_gpio,
        .mode = GPIO_MODE_OUTPUT,
    };
    if (lcd_gpio_valid(profile->lcd.backlight))
        out.pin_bit_mask |= 1ULL << (uint32_t)profile->lcd.backlight;
    if (lcd_gpio_valid(profile->lcd.rst))
        out.pin_bit_mask |= 1ULL << (uint32_t)profile->lcd.rst;
    err = gpio_config(&out);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "gpio_config failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }

    if (lcd_gpio_valid(profile->lcd.rst)) {
        gpio_set_level((gpio_num_t)profile->lcd.rst, 0);
        vTaskDelay(pdMS_TO_TICKS(20));
        gpio_set_level((gpio_num_t)profile->lcd.rst, 1);
        vTaskDelay(pdMS_TO_TICKS(120));
    }
    if (lcd_gpio_valid(profile->lcd.backlight))
        esp32_backlight_init_default();

    if (!s_shadow) {
        s_shadow = heap_caps_malloc((size_t)LCD_W * LCD_H * sizeof(*s_shadow),
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        if (!s_shadow) {
            ESP_LOGE(TAG, "PSRAM shadow allocation failed");
            lcd_release_resources(1);
            return;
        }
    }
    if (!s_flush) {
        s_flush = heap_caps_malloc(LCD_FLUSH_BYTES, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
        if (!s_flush)
            ESP_LOGW(TAG, "DMA flush buffer allocation failed; using row flush");
        else
            ESP_LOGI(TAG, "DMA flush buffer ready: %u bytes / %d rows",
                     (unsigned)LCD_FLUSH_BYTES, LCD_FLUSH_ROWS);
    }

    lcd_init_controller();

    esp32_ili9341_lcd_bind_panel();
    Option.DefaultFont = 0x01;
    Option.ColourCode = 1;
    if (Option.DefaultFC == 0 && Option.DefaultBC == 0) {
        Option.DefaultFC = WHITE;
        Option.DefaultBC = BLACK;
    }
    esp32_board_profile_reserve_lcd_pins();
    ApplyDefaultConsoleColours();
    CurrentX = 0;
    CurrentY = 0;
    ClearScreen(gui_bcolour);
    ESP_LOGI(TAG, "ILI9341 ready on %s", profile->platform_name);
}
